#pragma once
<<<<<<< HEAD

/*
	title :
	2588. 곱셈

=======
/*
	title :
	2588. 곱셈
>>>>>>> Math
	quest :
		(세 자리 수) × (세 자리 수)는 다음과 같은 과정을 통하여 이루어진다.
					472
				x	385
				   2360
				  3776
				 1416
<<<<<<< HEAD
			     181720
		(1)과 (2)위치에 들어갈 세 자리 자연수가 주어질 때 (3), (4), (5), (6)위치에 들어갈 값을 구하는 프로그램을 작성하시오.

	Input :
		첫째 줄에 (1)의 위치에 들어갈 세 자리 자연수가, 둘째 줄에 (2)의 위치에 들어갈 세자리 자연수가 주어진다.

	Output :
		첫째 줄부터 넷째 줄까지 차례대로 (3), (4), (5), (6)에 들어갈 값을 출력한다.

=======
				 181720
		(1)과 (2)위치에 들어갈 세 자리 자연수가 주어질 때 (3), (4), (5), (6)위치에 들어갈 값을 구하는 프로그램을 작성하시오.
	Input :
		첫째 줄에 (1)의 위치에 들어갈 세 자리 자연수가, 둘째 줄에 (2)의 위치에 들어갈 세자리 자연수가 주어진다.
	Output :
		첫째 줄부터 넷째 줄까지 차례대로 (3), (4), (5), (6)에 들어갈 값을 출력한다.
>>>>>>> Math
	example :
		input
			472
			385
		output
			2360
			3776
			1416
			181720
<<<<<<< HEAD


=======
>>>>>>> Math
	Limited-time :
		1 초
	Limited-space :
		256 MB
*/