#pragma once
/*
Title :
9653. 스타워즈 로고

시간 제한	메모리 제한	제출	정답	맞힌 사람	정답 비율
1 초	128 MB	11180	8043	7674	73.668%
문제
스타워즈 로고를 예제 출력과 같이 출력하는 프로그램을 작성하시오.

출력
스타워즈 로고를 출력한다.

예제 입력 1
예제 출력 1
    8888888888  888    88888
   88     88   88 88   88  88
    8888  88  88   88  88888
       88 88 888888888 88   88
88888888  88 88     88 88    888888

88  88  88   888    88888    888888
88  88  88  88 88   88  88  88
88 8888 88 88   88  88888    8888
 888  888 888888888 88  88      88
  88  88  88     88 88   88888888

*/